[
{"name": "Section 44", "text": "In the case where the Head of the National Council for Peace and Order is of opinion that it is necessary for the benefit of reform in any field and to strengthen public unity and harmony, or for the prevention, disruption or suppression of any act which undermines public peace and order or national security, the Monarchy, national economics or administration of State affairs, whether that act emerges inside or outside the Kingdom, the Head of the National Council for Peace and Order shall have the powers to make any order to disrupt or suppress regardless of the legislative, executive or judicial force of that order. In this case, that order, act or any performance in accordance with that order is deemed to be legal, constitutional and conclusive, and it shall be reported to the National Legislative Assembly and the Prime Minister without delay."},
{"name": "Section 40", "text": "Salaries, emoluments and other benefits of the President and Vice-Presidents of the National Legislative Assembly, Chairperson and Vice-Chairpersons of the National Reform Council, persons holding position in the National Council for Peace and Order, members of the National Legislative Assembly, members of the National Reform Council and members of the Constitution Drafting Committee shall be prescribed by the Royal Decree."},
{"name": "Section 1", "text": "His Majesty King Bhumibol Adulyadej is graciously pleased to proclaim that:"},
{"name": "Section 4", "text": "Any person who commits an act of domestic violence is said to commit an offence of domestic violence and shall thereby be liable to imprisonment for not more than six months, or a fine of not exceeding six thousand baht or both."},
{"name": "Section 27", "text": "There shall establish the National Reform Council to study and provide recommendation for reform in the following fields:"},
{"name": "Section 32", "text": "There shall establish the Constitution Drafting Committee to prepare the Draft Constitution, consisting of thirty-six members appointed by the Chairperson of the National Reform Council from the following persons:"},
{"name": "The criminal cases related to certain persons as follows:", "text": ""},
{"name": "Section 1", "text": "His Majesty King Bhumibol Adulyadej is graciously pleased to proclaim that:"},
{"name": "Section 123", "text": "Whereas an Employer violates or fails to comply with an Employee’s entitlement to receive any payments prescribed under this Act, and the Employee wishes the Labor Inspector to enforce the entitlement under this Act, the Employee us entitled to lodge a complaint, in a form prescribed by the Director-General, to the Labor Inspector of the locality where the Employee works or where the Employer’s domicile is located."},
{"name": "Section 40", "text": "Challenge of an arbitral award may be made a motion for setting aside to the competent court in accordance with this Section."},
{"name": "Section 46", "text": "Unless otherwise agreed by the parties, the fees and expenses incidental to the arbitral proceedings and the remunerations for arbitrator, excluding attorney’s fees and expenses, shall be in accordance with that stipulated in the award of the arbitral tribunal."},
{"name": "Section 36", "text": "The Constitution Drafting Committee shall propose the Draft Constitution to the Chairperson of the National Reform Council. In this case, the Chairperson of the National Reform Council shall convene the meeting of the National Reform Council for deliberation of the Draft Constitution within ten days as from the date the Chairperson of the National Reform Council receives the Draft Constitution."},
{"name": "Section 41", "text": "Subject to Section 42, Section 43 and Section 44, an arbitral award, irrespective of the country in which it was made, shall be recognized as binding on the parties, and upon petition to the competent court, shall be enforced."},
{"name": "Section 34", "text": "The arbitral tribunal shall decide the dispute in accordance with the governing law chosen by the parties. Any designation of law or legal system of a country shall be construed, unless otherwise expressed, as directly referring to the substantive law of the country and not to its conflict of laws rules."},
{"name": "Section 1", "text": "His Majesty King Bhumibol Adulyadej is graciously pleased to proclaim that:"},
{"name": "ARTICLE XIV: Closing", "text": " the respective Plenipotentiaries have signed the present Treaty and have affixed hereunto their seals."},
{"name": "ARTICLE XIII: Representation and Disputes", "text": "Right to Representation"},
{"name": "ARTICLE X: Freedom of Navigation", "text": "Freedom of Commerce and Navigation"},
{"name": "ARTICLE XII: Allowable Restrictions", "text": "Allowable Restrictions"},
{"name": "ARTICLE IX: Import Export", "text": "Notice of Customs Regulations"},
{"name": "ARTICLE XI: Business with Government", "text": "Government Owned Enterprises"},
{"name": "Section 25", "text": "In the arbitral proceedings, the parties shall be treated with equality and shall be given a full opportunity of presenting their cases in accordance with the circumstances of the dispute."},
{"name": "ARTICLE VIII: Restrictions", "text": "Customs Duties"},
{"name": "ARTICLE VII: Currency Exchange", "text": "No Restrictions on the Transfer of Funds"},
{"name": "ARTICLE VI: Taxes", "text": "Equal Treatment for Taxes"},
{"name": "ARTICLE III: Property and Buildings", "text": "Fair and Equal Treatment"},
{"name": "ARTICLE IV: Types of Business Activities", "text": "Equal Treatment in Business Activities"},
{"name": "ARTICLE V: Business Property", "text": "Equal Treatment for Leasing Property"},
{"name": "ARTICLE II: Juristic Persons and Courts", "text": "Juristic Persons"},
{"name": "ARTICLE I: Traders and Investors", "text": "Nationals Carrying Our Trade or Investment"},
{"name": "Article 78", "text": "Any person who violates Article 26 shall be liable to a term of imprisonment not exceeding three months or a fine not exceeding 30,000 Baht, or both."},
{"name": "Article 63", "text": "Schools and educational establishments shall set up systems and activities to provide guidance, counselling and training for pupils, students and guardians, with a view to promoting appropriate behaviour, social responsibility and safety for the pupils and students, in accordance with the criteria, procedures and conditions stipulated in the ministerial regulations."},
{"name": "Article 51", "text": "The Permanent Secretary has the power to establish a nursery, remand home, welfare centre, safety protection centre and development and rehabilitation centre throughout the Kingdom and the Provincial Governor has the power to establish a nursery, remand home, welfare centre, safety protection centre and development and rehabilitation centre within his or her respective province. \tOther government agencies, in additions to those duties specified under this Act, may establish and operate a nursery only by notifying the Permanent Secretary or the Provincial Governor, as the case may be, who shall advise or support such establishment and operation thereof."},
{"name": "Article 68", "text": "The Government shall set aside a budget for the establishment of a fund at the Office of the Permanent Secretary of the Ministry of Social Development and Human Security called the “Child Protection Fund” for use as capital for providing welfare assistance, safety protection and behaviour promotion of a child, including the child’s family and foster family under this Act."},
{"name": "Section 241. No Right to Retention until Obligation is due", "text": "If the possessor of a property belonging to another has an obligation in his favor relating to the property possessed, he may retain the property until the obligation is performed; but this does not apply, if the obligation is not yet due."},
{"name": "Section 233. Creditor Subrogation of Debtor’s Rights", "text": "If, to the prejudice of the creditor, the debtor refuses or neglects to exercise a claim the creditor may, in order to protect his obligation, exercise such claim in his own name of behalf of the debtor, except those which are purely personal to the debtor."},
{"name": "Section 203. Time for Performance", "text": "If a time for performance is neither fixed nor to be inferred from the circumstances, the creditor may demand the performance forthwith, and the debtor may perform his part forthwith."},
{"name": "Section 226. Subrogation", "text": "A person is subrogated to the rights of a creditor is entitled to exercise in his own name all the rights which the creditor had in respect of the obligation including any security for it."},
{"name": "Section 194. Obligations give rise to Claims", "text": "By virtue of an obligation the creditor is entitled to claim performance from the debtor. The performance may consist in a forbearance."},
{"name": "Section 193/30. 10 Years Default", "text": "The period of prescription for which no other period is provided by law is ten years."},
{"name": "Section 193/9. Prescription - Statute of Limitations", "text": "A claim is barred by prescription if it has not been enforced within the period of time fixed by law."},
{"name": "Section 172. Void Acts", "text": "A void act cannot be ratified, and its nullity may be alleged at any time by any interested person."},
{"name": "Section 149. Juristic Acts", "text": "Juristic act are voluntary lawful acts, the immediate purpose of which is to establish between persons relations, to create, modify, transfer, preserve or extinguish rights."},
{"name": "Section 137. Things", "text": "Things are physical objects."},
{"name": "Section 110. Foundations – Non Profit", "text": "A foundation consists of property specially appropriated to public charity, religious, art, scientific, education or other purpose for the public benefit and not for sharing profit, and has been registered under the provisions of this Code."},
{"name": "Section 78. Associations", "text": "An association created for conducting any activity which, according to its nature, is to be done continuously and collectively by persons other than that of sharing profits or incomes earned, must have its regulations and must be registered according to the provisions of this Code."},
{"name": "Article 48", "text": "In carrying out welfare assistance, safety protection, and behaviour promotion of the child in accordance with the Act or other laws, if a competent official deems it fit to appoint a safety protector for any child, the competent official shall submit a request to the Permanent secretary or the Provincial Governor, as the case may be, to appoint a competent official, social worker or a willing and suitable person to be the child’s safety protector, with or without specifying the place of residence of the child who is under care of the safety protector."},
{"name": "Section 65. Law Created Person", "text": "A juristic person can come into existence only by virtue of this Code or of other law."},
{"name": "Section 37. Domicile is the permanent home.", "text": "The domicile of a natural person is the place where he has his principal residence."},
{"name": "Article 40", "text": "Children warranting safety protection are defined as follows:"},
{"name": "Article 17", "text": "There shall be a Provincial Child Protection Committee, composed of the Governor as Chairperson of the Committee, Deputy Governor designated by the Governor as Vice-Chairperson, members comprising the Provincial Prosecutor, Permanent Secretary of the Bangkok Metropolis, Chief of Provincial Development, Chief of Provincial Labour and Social Welfare, Chief of Provincial Education, Chief of provincial Public Health, Provincial Police Commissioner, representative from the Provincial Juvenile and Family Court or, in the case where no Juvenile and Family Court exists in the province, a representative from the Provincial Court, representative from the Provincial Observation and Protection Centre, or representative from the Ministry of Justice appointed from officials in that province in the case where there is no Provincial Observation and Protection Centre, and President of the Provincial Administration Organization, and distinguished members appointed by the Governor from experts who have no less than seven years’ experience in the fields of social welfare, teaching, psychology, law, and medicine, two from each field, one out of which shall come from private organizations, including two additional distinguished members appointed from those with apparent experience in child welfare. Chief of the Provincial Social Development and Welfare Office shall act as member and Secretary."},
{"name": "Article 22", "text": "Treatment of the Child in any case shall give primary importance to the best interests of the child and any discrimination of an unfair nature shall not be allowed."},
{"name": "Article 32", "text": "Children warranting welfare assistance include as follows:"},
{"name": "Article 7", "text": "There shall be a National Child Protection Committee made up of the Minister of Social Development and Human Security as Chairperson of the Committee, the Permanent Secretary to the Ministry of Social Development and Human Security as ViceChairperson, members comprising the Permanent Secretary to the Ministry of Interior, the Permanent Secretary to the Ministry of Justice, the Permanent Secretary to the Ministry of Education, the Attorney General, the Chief of the Royal Thai Police, the Director-General of the Department of Provincial Administration, the Director-General of the Department of Mental Health, the Chief Judge of the Central Juvenile and Family Court, and the Director of the Office of Welfare Promotion and Protection and Empowerment of Vulnerable Groups, and distinguished members appointed by the Minister from experts who have had no less than seven years professional experience in the fields of social welfare, teaching, psychology, law and medicine, two from each field, one of which shall be a representative from the private sector, and two additional persons appointed from those who have demonstrable experience in child welfare of no less than seven years. The Deputy Permanent Secretary to the Ministry of Social Development and Human Security, designated by the Minister, shall act as member and Secretary of the Committee."},
{"name": "Article 1", "text": "His Majesty King Bhumibol Adulyadej is graciously pleased to proclaim that:"},
{"name": "Section 37", "text": "As far as succession concerns immovable property, the law of the place where such property is situated shall govern."},
{"name": "Section 15. Beginning of Human Life", "text": "Personality begins with the full completion of birth as a living child and ends with death."},
{"name": "Section 18", "text": "The capacity for affecting a betrothal or for putting an end to the same is governed by the law of nationality of each party. The effects of the betrothal are governed by the law of the country to which the court trying and adjudication the case belong."},
{"name": "Section 95", "text": "There shall be a committee called the Trademark Board composed of the Director-General of the Department of Intellectual Property as chairman, the Secretary General of the Juridical Council or his representative, the Attorney-General or his representative and no fewer than eight nor more than twelve other qualified persons in the fields of law or commerce with the experience in intellectual property or trademarks appointed by the Council of Ministers as members."},
{"name": "Section 13", "text": "The question as to what law is applicable in regard to the essential elements or effects of a contract is determined by the intention of the parties to it. If such intention, express or implied, cannot be ascertained, the law applicable is the law common to the parties when they are of the same nationality, or, if they are not of the same nationality, the law of the place where the contract has been made."},
{"name": "Section 1", "text": "Whereas the House of Representatives has passed a resolution that it is deemed expedient to enact an Act on Conflict of Laws;"},
{"name": "Section 103", "text": "Any person shall be entitled, during office hours, to inspect the register of trademarks, service marks, certification marks and collective marks and files thereof, to obtain copies or certified copies of documents and apply for certification by the Registrar of particular of registration on payment of the fees prescribed in the Ministerial Regulations."},
{"name": "Section 94", "text": "Except for the provisions of Chapter I, Part 5, the provisions concerning trademarks shall apply to collective marks "},
{"name": "Section 68", "text": "The owner of a registered trademark may license another person to use the trademark for all or some of the goods for which the trademark is registered."},
{"name": "Section 80", "text": "The provision concerning trademarks shall apply to service marks "},
{"name": "Section 57", "text": "The owner of a trademark may request the Registrar to cancel his trademark registration but in the case where the trademark is the subject of a registered license agreement, the consent of the licensee shall be required unless the license agreement provides otherwise."},
{"name": "Section 48", "text": "The right to a pending trademark application may be assigned or transferred by succession."},
{"name": "Section 53", "text": "The registration of a trademark shall have a term of ten years from the date of registration under Section 42 and may be renewed under Section 54."},
{"name": "Section 42", "text": "A trademark when registered shall be deemed registered as of the date of application for registration. For the case under Section 28 or 28bis, the date of application in Thailand shall be deemed to be the date of registration of such trademark."},
{"name": "Section 25", "text": "In the case where the Registrar has been informed within the period specified in Section 24 as to which applicant is allowed by agreement to register, the Registrar shall order the application of such applicant to be published under Section 29."},
{"name": "Section 29", "text": "When an application for registration of a trademark is considered acceptable, the Registrar shall order the application to be published. The publication of applications shall be in accordance with the procedures prescribed in the Ministerial Regulations."},
{"name": "Section 35", "text": "After the publication of a trademark application under Section 29, any person who thinks that he has better right in the trademark than the applicant or that the trademark is not registrable under Section 6 or that the application is not in conformity with the provisions of this Act may, within ninety days from the date of publication under Section 29, file a notice of opposition with the Registrar stating the grounds of the opposition."},
{"name": "Section 14", "text": "In the event registered or pending trademarks of the same owner covering goods of the same class or different classes but the same character so similar to one another that the public might be confused or misled as to the owner or origin of the goods if used by different persons, the Registrar shall require the trademarks to be registered as associated trademarks and shall in writing notify the applicant without delay."},
{"name": "Section 6", "text": "To be registrable, a trademark must:"},
{"name": "Section 1", "text": "This Act shall be called as the “Trademark Act B.E. 2534”."},
{"name": "Section 24", "text": "The arbitral tribunal shall be competent to rule on its own jurisdiction, including the existence or validity of the arbitration agreement, the validity of the appointment of the arbitral tribunal, and issues of dispute falling within the scope of its authority. For that purpose, an arbitration clause, which forms part of a contract, shall be treated as an agreement independent of the main contract. A decision by the arbitral tribunal that the contract is null and void shall not affect the validity of the arbitration clause."},
{"name": "Section 11", "text": "Arbitration agreement means an agreement by the parties to submit to arbitration all or certain disputes which have arisen or which may arise between them in respect of a defined legal relationship, whether contractual or not. An arbitration agreement may be in the form of an arbitration clause in a contract or in the form of a separate agreement.\r\nThe arbitration agreement shall be in writhing and signed by the parties. An arbitration clause constitutes an arbitration agreement if it is contained in an exchange between the parties by means of letters, facsimiles, telegrams, telex, data interchange with electronic signature, or other means which provide a record of the agreements, or in an exchange of statement of claim and defense in which the existence of an agreement is alleged by one party and not denied by the other."},
{"name": "Section 17", "text": "The arbitral tribunal shall be composed of an uneven number of arbitrators."},
{"name": "Section 116", "text": "Whereas an Employee alleged to have committed an offence is under investigation by an Employer, the Employer is not allowed to order the suspension from work of the Employee during such investigation, unless the Employer is empowered by the work rules or an agreement on conditions of employment to order such. The Employer shall issue a written order of the suspension stating the offence committed and the period of suspension of not exceeding seven days, and notify the Employee prior to the suspension."},
{"name": "Section 118", "text": "An Employer shall pay Severance Pay to an Employee who is terminated as follows:"},
{"name": "Section 108", "text": "An Employer who employs ten or more persons shall provide the work rule in Thai and the rules shall contain at least the following details:"},
{"name": "Section 100", "text": "There shall be an Occupational Safety, Health and Environment Committee consist of the Permanent-Secretary of the Ministry of Labor and Social Welfare as chairperson, the Director-General of the Department of Labor Protection and Welfare, a representative of the Department of Health, a representative of the Department of Industrial Works, a representative of the Public Works Department, and a representative of the Pollution Control Department as members, seven representatives each from Employers and Employees, appointed by the Minister as members; and an official of the Department of Labor Protection and Welfare appointed by the Minister as a member and secretary."},
{"name": "Section 92", "text": "There shall be a Labor Welfare Committee consisting of the Permanent Secretary of the Ministry of Labor and Social Welfare as Chairperson; four representatives from government, five representatives each from both Employers and Employees appointed by the Minister as members and an official of the Department of Labor Protection and Welfare appointed by the Minister as the secretary."},
{"name": "Section 78", "text": "There shall be a Wages Committee, consisting of the Permanent Secretary of the Ministry of Labor and Social Welfare as Chairperson, four government representatives, five representatives each from both Employers and Employees appointed by the Cabinet as members, and an official of the Ministry of Labor and Social Welfare appointed by the Minister as the secretary."},
{"name": "Section 66", "text": "An Employee under Section 65 (1) shall not be entitled to Holiday Pay under Section 62, unless the Employer agrees to pay Holiday Pay to the Employee."},
{"name": "Section 53", "text": "Whereas the work is of the same nature and quality and equal quantity, an Employer shall fix equal Wages, Overtime Pay, Holiday Pay and Holiday Overtime Pay to be paid to an Employee, notwithstanding that the Employee is male or female."},
{"name": "Section 83", "text": "In a meeting where the Chairperson of the Committee is not present or unable to perform his or her duty, the members present shall elect one among themselves to be the Chairperson of the meeting."},
{"name": "Section 44", "text": "An Employer shall not empty a child under fifteen years of age as an Employee."},
{"name": "Section 38", "text": "An Employer shall not require a female Employee to do any of the following work:"},
{"name": "Section 52", "text": "Whoever commits an offence of trafficking in persons shall be liable to the punishment of an imprisonment from four years to ten years and a fine from eighty thousand Baht to two hundred thousand Baht."},
{"name": "Section 23", "text": "An Employer shall notify Employees of the normal working time whereby the commencing and ending time of work for an Employee in each day and does not exceed the working time for each type of work as prescribed in the Ministerial Regulations the working time shall not exceed eight hours per day and the total working time per week shall not exceed forty-eight hours. Where the work may be hazardous to the health and safety of the Employee as prescribed in the Ministerial Regulations, the normal working time shall not exceed seven hours per day and the total working time per week shall not exceed forty-two hours."},
{"name": "Section 7", "text": "A claim for or the acquisition of a right or benefit under this Act shall not deprive an Employee of a right or benefit to which he or she is otherwise entitled under other laws."},
{"name": "Section 1", "text": "His Majesty the King Bhumibol Adulyadej is graciously pleased to proclaim that:"},
{"name": "Section 11", "text": "The powers to make prohibitions are as follows:"},
{"name": "Section 16. Unable to Claim for Compensation or Indemnity for any Damage from the Military Authority", "text": "No compensation or indemnity for any damage which may result from the exercise of powers of the military authority as prescribed in sections 8 to section 15 may be claimed from the military authority by any person or company, because all powers are exercised by the military authority in the execution of this Martial Law with a view to preserving, by military force, the prosperity, freedom, peace and internal or external security for the King, the Nation and the religion."},
{"name": "Section 33", "text": "The Ministry of Social Development and Human Security shall consider to provide assistance as appropriate to a trafficked person on food, shelter, medical treatment, physical and mental rehabilitation, education, training, legal aid, the return to the country of origin or domicile, the legal proceedings to claim compensation according to the regulations prescribed by the Minister, providing that human dignity and the difference in sex, age, nationality, race, and culture of the trafficked person shall be taken into account. The right to receive protection, whether it be prior to, during and after the assistance providing, including the timeframe in delivering assistance of each stage, shall be informed the trafficked person. In this connection, the opinion of trafficked person is to be sought."},
{"name": "Section 42", "text": "There shall establish a Fund in the Ministry of Social Development and Human Security to be called \"the Anti Trafficking in Persons Fund” to be used as capital for the prevention and suppression of trafficking in persons and the management of the Fund. The Fund shall consist of;"},
{"name": "Section 27", "text": "For the purpose of prevention and suppression of the commission of the trafficking in persons, the competent official shall have the following powers and duties:"},
{"name": "Section 6", "text": "Within the area under the Martial Law, the military authority shall have superior power over the civil authority in regard to military operation, desistance or suppression, or keeping public order. The civil authority shall act in compliance with the requirements of the military authority."},
{"name": "Section 1. Name of the Act", "text": "This Act is called the “Martial Law, B.E. 2457”."},
{"name": "Section 6", "text": "Whoever, for the purpose of exploitation, does any of the following acts:"},
{"name": "Section 15", "text": "There shall be an Anti-Trafficking in Persons Committee to be called “ATP Committee” in brief, consisting of the Prime Minister as chairman, the Deputy Prime Minister, who acts as Chairman of the CMP Committee, as vice chairman, the Minister of Defense, the Minister of Foreign Affairs, the Minister of Tourism and Sports, the Minister of Social Development and Human Security, the Minister of Interior, the Minister of Justice, the Minister of Labour, and four qualified persons appointed by the Prime Minister from experts who have had no less than seven years demonstrable professional experiences in the fields of prevention, suppression, rehabilitation and international cooperation on the issues of trafficking in persons, one from each field, provided that not less than one half appointed from the private sector, as members, and the Permanent Secretary for Social Development and Human Security shall be the secretary and the Director-General of the Department of Social Development and Welfare and the Director-General of the Office of Welfare Promotion, Protection and Empowerment of Vulnerable Groups shall be the assistant secretaries."},
{"name": "Section 1", "text": "His Majesty King Bhumibol Adulyadej is graciously pleased to proclaim that:"},
{"name": "Section 97", "text": "The following juristic persons shall be entitled to the same rights as the foreigners."},
{"name": "Section 86", "text": "Aliens may acquire land by virtue of the provisions of a treaty giving the right to own immovable properties and subject to the provisions of this Code."},
{"name": "Section 84", "text": "Wats, temples, Roman Catholic Churches, Christian Foundations or Moslem may acquire land with the permission of the Minister and may acquire not more than fifty "},
{"name": "Section 58", "text": "Any land developer or any interested person who fails to give statement or fails to furnish the documents as summoned or ordered by the Central Land Development Commission or the Commission under section 15, or any land developer or possessor of the developed land who fails to render convenience to the Central Land Development Commission, the Commission, the sub-committee or the person appointed by the Central Land Development Commission for the performance of the act under section 18 shall be liable for a fine not exceeding ten thousand Baht."},
{"name": "Section 80", "text": "In case of redemption of land mortgage or redemption of the land sold with right to redeem whereby a document of land rights has been issued to the said land, the land rights holder or the person with right to redeem may, upon the document made by the mortgagee or the buyer evidencing that the land is already redeemed, present the document of land rights to the competent officials in order to have such redemption registered."},
{"name": "Section 54", "text": "In the case where the land developer intends to cancel the land development, the land developer shall submit an application to the "},
{"name": "Section 67", "text": "All Ministerial Regulations and stipulations issued under the Announcement of the National Executive Council No. 286 dated 24th November B.E. 2515 (1972) shall continue to be in force insofar as they are not contrary to or inconsistent with the provisions of this Act until Ministerial Regulations and stipulations are issued under this Act."},
{"name": "Section 71", "text": "For any immovable property in the locality of the Provincial Land Office or the Branch Land Office, the land officers shall be the competent officials for registration of rights and juristic acts in connection with the "},
{"name": "Section 49", "text": "The fee for the maintenance and management of public facilities shall be levied on a monthly basis from every sub-lot of land under the project. For this purpose, different rates of fee may be fixed by reference to the type of use of land or the space, in accordance with the Rule prescribed by the Central Land Development Commission."},
{"name": "Section 45", "text": "In establishing a developed-estate juristic entity, purchasers of developed land of not less than one-half of sub-lots in the map under the project shall pass a resolution for such purpose and shall appoint a representative who shall submit to the "},
{"name": "Service 43", "text": "Public facilities provided by the land developer for the purpose of the land development in accordance with the approved map and project, such as the road, park or children playground, shall be subject to the servitude in the interest of the developed land. In this connection, the land developer shall have the duty to maintain such public facilities to be in the original condition and shall refrain from doing any act which tends to diminish the utility of the servitude or to make it less convenient."},
{"name": "Section 34", "text": "An agreement to sell the developed land between the land developer and the purchaser of the developed land shall be in accordance with the form prescribed by the Central Land Development Commission."},
{"name": "Section 31", "text": "A land developer shall display the license, map, project and procedure approved by the Commission in an open and conspicuous place at the office used for the land development."},
{"name": "Section 38", "text": "If the land developer intends to transfer his or her license, the land developer shall submit an application to the Commission in accordance with the form prescribed by the Central Land Development Commission."},
{"name": "Section 27", "text": "The issuance of a land development license shall be made by the Commission within seven days as from:"},
{"name": "Section 21", "text": "No person shall carry out land development unless upon permission by the Commission."},
{"name": "Section 13", "text": "There shall be, in every Province, the Provincial Land Development Commission, as follows:"},
{"name": "Section 65", "text": "Land surveys for the issuance of title deeds shall be in accordance with rules and procedures prescribed in Ministerial Regulations."},
{"name": "Section 34. Repealed", "text": "In disposing of land under the provisions of this Code, the Director-General shall have the power to dispose of it by sale or hire-purchase according to the rules and procedures specified in Ministerial Regulations and shall have the power to levy a fee of not more than five per cent of the sale price. If unable to dispose of the land within two years the Director-General with the approval of the Minister shall have the power to sell on installments within ten years."},
{"name": "Section 59", "text": "In a case where there is a particular request for the issuance of the Title Deed or the Utilization Certificate by the person with possessory right, irrespectively of whether the notification of the Minister is made under Section 58, the competent officials may, if consider appropriate, proceed the issuance of the Title Deed or, as the ca se may be, the Utilization Certificate as requested in accordance with the rules and procedures prescribed in this Code."},
{"name": "Section 61", "text": "In a case where there appears an inaccuracy or illegality in connection with the issuance of the Title Deed or the Utilization Certificate, the registration of rights and juristic acts for the immovable property, or the record making of the list of registered immovable properties, the Director-General or either the Deputy Director-General or the Inspector of the Department of Land authorized thereby shall have power to order the annulment or amendment thereof."},
{"name": "Section 56", "text": "Subject to Section 56/1, forms, rules, and procedures for issuance of the Pre-emption Certificate, the Utilization Certificate, the Land Examination Certificate, or the Title Deed, including the substitutions thereof shall be in accordance with the Ministerial Regulations."},
{"name": "Section 25", "text": "For the purpose of the land allocation and examination of fertility of soil, the Committee may make arrangement for land survey."},
{"name": "Section 14", "text": "There shall be a committee called “The National Land Allocation Committee” consisting of the Minister of Natural Resources and Environment as Chairman, the Deputy Minister of Interior, the Permanent Secretary of Interior, the Permanent Secretary of Defence, the Director-General of the Department of Local Administration, the Director-General of the Department of Social Development and Welfare, the Director-General of the Cooperative Promotion Department, the Director-General of the Department of Highways, the Director- General of the Royal Irrigation Department, the Director-General of the Land Development Department, the Director-General of the Department of Mineral Resources, the Director- General of the Department of Agricultural Extension, the Director-General of the Royal Forest Department, the Director-General of the Treasury Department, the Director of the Bureau of the Budget, the Secretary-General of the Council of State of Thailand, the Secretary-General of the National Economic and Social Development Board, and the Secretary-General of the Accelerated Rural Development as members, the Director of the Office of Natural Resources and Environmental Policy and Planning as member and Secretary-General and not more than seven qualified persons appointed by the Council of Ministers as members."},
{"name": "Section 8", "text": "Unless otherwise provided by the law, the Director-General shall have powers and duties to supervise and carry out acts for purpose of protection and prevention, as it may think fit, of all land which is the public domain public of State or the State property. The Minister may assign this powers and duties to other public bodies."},
{"name": "Section 1", "text": "In this Code:"},
{"name": "Section 87. Liability to the Extent of the Advertisement", "text": "In case of an offence is committed on account of having a person to employ an another person to commit the offence according to Section 84, or on account of having a person to propagate or publish to the general public to commit the offence according to Section 85, or by having the supporter according to Section 86."},
{"name": "Section 1", "text": "BHUMIBOL ADULYADEJ REX"},
{"name": "Section 7", "text": "There shall be the Central Land Development Commission consisting of the Permanent-Secretary for the Ministry of Interior as the Chairman, Prosecutor-General, Secretary-General of the Consumer Protection Commission, Secretary-General of the Office of the Environmental Policy and Planning, Director-General of the Department of Local Administration, Director-General of the Department of Town and Country Planning, Director-General of the Royal Irrigation Department, Directory-General of Department of Civil Engineering and six qualifies persons appointed by the Minister from persons having knowledge, capability and experience in the field of real estate development, town planning, community management or law, as members, and Director-General of the Lands Department as a member and secretary."},
{"name": "Section 1", "text": "His Majesty King Bhumibol Adulyadej is graciously pleased to proclaim that:"},
{"name": "Section 83. Principals", "text": "In case of any offence is accrued by commission of the person as from two persons upwards, such accomplices deemed to be principals shall be punished as provided by the law for such offence."},
{"name": "Section 80. Attempt", "text": "Whoever commences to commit an offence, but does not carry it through, or carries it through, but does not achieve its end, is said to attempt to commit an offence."},
{"name": "Section 73. Children under Ten", "text": "A child not yet over ten years of age shall not be punished for committing what is provided by the law to be an offence."},
{"name": "Section 66. Intoxication", "text": " Intoxication on account of taking liquor or any other intoxicant may not be raised as an excuse under Section 65, except where such intoxication is caused without the knowledge or against the will of the offender, and such person has committed the offence at the time of not being able to appreciate the nature of illegality of his act or not being able to control himself, the offender shall then be exempted from the punishment for such offence. But, if such person is still partially able to appreciate the nature or illegality of his act, or is still partially able to control himself, the Court may inflict less punishment to any extent than that provided by the law for such offence."},
{"name": "Section 56. Terms for Suspended Sentence for Reform", "text": "Whoever commits offence with imprisonment, and in such case, the Court will imprison him not exceeding three years, if it does not appear that such person has been imprisoned before, or if such person previously undertook the punishment of imprisonment but it is punishment for offence committed by negligence or petty offence, when the Court has taken into consideration of sex, age, past record, religion, behavior, intelligence, education, health, mind-condition, temperament, occupation and envelopment of such person or the fined person's offence condition or other extenuating circumstance, it deems advisable, the Court will trial that such person has an offence but suspension of the determination of punishment or designates the punishment but the suspension of the in friction of punishment and then one is released for giving the time to such person reforming oneself within the period designated by the Court, but it must be not out of five year as from the date of the Court has passed a judgment and it will be designated by the condition for controlling such person's behavior or not."},
{"name": "Section 39. Measures of Safety", "text": "The measures of safety are as follows:"},
{"name": "Section 51. Increase in Punishment", "text": "In increasing the punishment, it shall not be increased up to the punishment of death, imprisonment for life or imprisonment exceeding fifty years."},
{"name": "Section 44. Prohibition to Enter", "text": "Prohibition to enter a specified area is the prohibition to enter a locality or place specified in the judgment."},
{"name": "Section 59. Intention or Negligence", "text": "A person shall be criminally liable only when such person commits an act intentionally, except in case of the law provides that such person must be liable when such person commits an act by negligence, or except in case of the law clearly provides that such person must be liable even though such person commits an act unintentionally."},
{"name": "Section 31. Multiple Offenders – Punishment of a Fine", "text": "In case the Court shall pass judgment inflicting the punishment of fine on several offenders for the same offence and in the same case, the Court shall inflict the punishment of fine on every individual offender."},
{"name": "Section 28. Payment of Fine", "text": "Any person has inflicted with the punishment of fine, such person must pay the money-month as determined by the judgment to the Court."},
{"name": "Section 18. Punishment", "text": "Punishments for inflicting upon the offenders are as follows:"},
{"name": "Section 13", "text": "The Ministry of Social Development and Human Security shall, by ministerial regulation, set up a working system in support of the activities under and the execution of sections 10, 11 and 12."},
{"name": "Section 16", "text": "For the purpose of compounding an offence of domestic violence, a competent authority or court, whichever applies, may appoint a mediator or panel of mediators, consisting of the fathers, mothers, guardians or relatives of the parties or other persons found appropriate by the competent authority or court; prescribed that these mediators shall provide advice or assistance in adopting a compromise between the parties. Otherwise, the competent authority or court may direct any social worker, social work agency or person to assist in adopting a compromise between the parties."},
{"name": "Section 11", "text": "In the course of an inquiry or trial, a court may issue an injunction indicating certain provisional measures or reliefs under section 10 or may issue any different injunction as it deems expedient."},
{"name": "Section 1. Terminology and Definitions", "text": "In this Code:"},
{"name": "Section 10", "text": "In executing section 8, a competent authority who ranks not lower than a senior administrative or police officer under the Code of Criminal Procedure and who is authorised by the Minister shall be invested with the power to, by order, indicate certain provisional measures or reliefs in favour of the domestic violence victim, whether or not the victim requests therefor."},
{"name": "Section 8", "text": "Where a complaint is entered before the expiry of the prescription period under section 7, the inquirer shall hold an inquiry without delay and shall send the domestic violence victim, inquiry files and his opinion to a public prosecutor who must then file a charge with the court within forty eight hours from the time the person committing the act of domestic violence is seized. If the charge cannot be filed within such period of time owing to whatever necessity, the public prosecutor may apply to the court for several extensions not exceeding six days each; prescribed that the court may not grant more than three successive extensions. The law on establishment of municipal courts and criminal procedure thereof shall also apply "},
{"name": "Section 2. Requirements for Application of Criminal Law", "text": "An act may only be punished if criminal liability had been established and penalty had been determined by the law which is in force at the time of the act. The penalty to be inflicted must be that which had been prescribed by such law."},
{"name": "Section 19", "text": "The King appoints the Prime Minister in accordance with the resolution of the National Legislative Assembly and not more than thirty-five other Ministers as recommended by the Prime Minister to constitute the Council of Ministers having the duties to carry out the administration of State affairs, to conduct reformation in all aspects and to strengthen unification and harmonization of Thai people.\r\nBefore taking office, a Minister must make a solemn declaration before the King in the following words: “I, (name of the declarer), do solemnly declare that I shall be loyal to the King and shall faithfully perform my duties in the interests of the country and of the people. I shall also uphold and observe the Constitution of the Kingdom of Thailand in every respect.”"},
{"name": "Section 21", "text": "In case of emergency and necessary urgency in order to maintain national security, public safety, national economic security or to avert public calamity or there is necessary to have a law on taxes, duties or currency which requires an urgent and confidential deliberation, the King has the prerogative to issue an Emergency Decree which shall have the force as an Act."},
{"name": "Section 1", "text": "Thailand is one and indivisible Kingdom."},
{"name": "Section 15", "text": "The Prime Minister shall present the bill or Organic Law bill approved by the National Legislative Assembly to the King for His signature within twenty days as from the date of receiving such bill from the National Legislative Assembly and the bill shall come into force as an Act or Organic Act upon its publication in the Government Gazette."},
{"name": "Section 6", "text": "There shall be the National Legislative Assembly, consisting of not more than two hundred and twenty members as appointed by the King from the persons of Thai nationality by birth of not less than forty years of age in accordance with the recommendation of the National Council for Peace and Order."},
{"name": "Article 13", "text": "The High Contracting Parties shall have the determination and good faith to prevent disputes from arising. In case disputes on matters directly affecting them shall refrain from the threat or use of force and shall at all times settle such disputes among themselves through friendly negotiations."},
{"name": "Article 4", "text": "The High Contracting Parties shall promote active cooperation in the economic, social, technical, scientific and administrative fields as well as in matters of common ideals and aspiration of international peace and stability in the region and all other matters of common interest."},
{"name": "Article 1", "text": "The High Contracting Parties:"},
{"name": "Article 16: Dependent Personal Services", "text": "Subject to the provisions of Articles 17 (Directors' Fees), 20 (Pensions and Social Security Payments), 21 (Government Service), 22 (Students and Trainees) and 23 (Teachers), salaries, wages, and other similar remuneration derived by a resident of a Contracting State in respect of an employment shall be taxable only in that State unless the employment is exercised in the other Contracting State. If the employment is so exercised, such remuneration as is derived therefrom may be taxed in that other State."},
{"name": "Article 19: Artists and Sportsman", "text": "Notwithstanding the provisions of Articles 15 (Independent Personal Services) and 16 (Dependent Personal Services), income derived by a resident of a Contracting State as an entertainer, such as a theater, motion picture, radio, or television artiste, or a musician, or as a sportsman, from his personal activities as such exercised in the other Contracting State, may be taxed in that other State, except where the amount of the gross receipts derived by such entertainer or sportsman from such activities does not exceed the lesser of 100 United States dollars or its equivalent in Thai currency per day or 3,000 United States dollars or its equivalent in Thai currency in the aggregate for the taxable year concerned."},
{"name": "Article 22: Students and Trainees", "text": "(a) An individual who is a resident of one of the Contracting States at the time he becomes temporarily present in the other Contracting State and who is temporarily present in that other Contracting State for the primary purpose of:"},
{"name": "Article 21: Government Service", "text": "Remuneration, other than a pension, paid by a Contracting State or a political subdivision or a local authority thereof to an individual in respect of services rendered to that State or subdivision or authority shall be taxable only in that State."},
{"name": "Article 20: Pensions and Social Security Payments", "text": "Subject to the provisions of paragraph 2 of Article 21 (Government Service), pensions and other similar remuneration paid to a resident of a Contracting State in consideration of past employment shall be taxable only in that State."},
{"name": "Article 14: Branch Tax", "text": "A corporation which is a resident of a Contracting State may, as provided in paragraphs 2 and 3, be subject in the other Contracting State to a tax in addition to the tax allowable under the other provisions of this convention."},
{"name": "Section 82", "text": "The following persons shall be taxable person under this Chapter;"},
{"name": "Section 83", "text": "Under Section 83/1, a VAT registrant shall file a tax return in such form as prescribed by the Director-General on the basis of tax month together with tax payment if any, whether or not sale of goods or provision of service are made in that tax month."},
{"name": "Section 23. Thai Woman Recovery of Nationality", "text": "A woman of Thai nationality who has renounced Thai nationality in case of marriage to an alien under Section 13 may, if the marriage has been dissolved by whatsoever reason, apply for recovery of Thai nationality."},
{"name": "Section 81", "text": "Value added tax shall be exempt on the following businesses:"},
{"name": "Section 80", "text": "The tax rate of 10.00% shall be used in value added tax calculation for the following businesses other than those specified under Section 80/2"},
{"name": "Section 67", "text": "For the benefit of operation under this Act, the officials shall be the officials according to the Penal Code and have the following authorities:"},
{"name": "Section 69", "text": "Whoever infringes the copyright or the performer's rights according to Section 27, Section 28, Section 29, Section 30 or Section 52 shall be inflicted with a fine from twenty thousand Baht up to two hundred thousand Baht."},
{"name": "Section 61", "text": "A copyright work of an author as well as rights of a performer of a country which is a member of the Convention on the protection of copyright or the Convention on the protection of performer's rights of which Thailand is also a member or a copyright work of an international organization of which Thailand is a member shall be protected by this Act."},
{"name": "Section 57. Source of Vested Powers", "text": "All powers and duties vested in the Board of Investment under the Announcement of the National Executive Council No. 227 dated October 18, B.E. 2515, concerning the execution of the Announcement of the National Executive Council No. 328, dated December 13, B.E. 2515 shall be the power and duties of the Board under this Act."},
{"name": "Section 54. Board Right to Withdraw Rights and Benefits", "text": "In the case where a promoted person violates or fails to comply with the conditions stipulated by the Board, the Board shall have the power to withdraw the rights and benefits granted to him, in toto or in part, and may prescribe the duration thereof."},
{"name": "Section 38. Import Duties on Essential Materials", "text": "The Board shall have the power to order the Department of Customs to release to the applicant who has confirmed the acceptance of promotion under section 21 or to the promoted person, as the case may be, all machinery, raw or essential materials ordered or imported into the Kingdom and entitled to exemption or reduction of import duties under this Act by treating a bank guarantee issued by a commercial bank in the Kingdom as a cash deposit against the payment of import duties and/or business taxes."},
{"name": "Section 50. Ban of Importing of Similar Products", "text": "In the case where the Board is of the opinion that the imposition of special fees under section 49 is inadequate for the protection of the activity of the promoted person, the Ministry of Commerce shall ban the import into the Kingdom of products or commodities of the same kind as, similar to, or substitutable with those produced or assembled by the promoted person in accordance with the law on the control of export and import into the Kingdom of certain goods."},
{"name": "Section 31. Income Tax Exemption", "text": "A promoted person shall be granted exemption of juristic person income tax on the net profit derived from the promoted activity as prescribed by an announcement of the Board, of which the proportion to the investment capital excluding cost of land and working capital shall be taken into consideration by the Board, for a period of not more than eight years from the date income is first derived from such activity."},
{"name": "Section 43. No Nationalization", "text": "The State shall not nationalize the activity of the promoted person."},
{"name": "Section 24", "text": "Subject to the law on immigration, only in so far as it is not otherwise provided herein, the Board shall have the power to grant permission to foreign nationals for entry into the Kingdom for the purpose of studying investment opportunities or performing any other act benefiting investment for such period of time to stay in the Kingdom as the Board may deem appropriate."},
{"name": "Section 16. Eligible Investments", "text": "The activities which are eligible for investment promotion by the Board are those which are important and beneficial to the economic and social development, and security of the country, activities which involve production for export, activities which have high content of capital, labor or service or activities which utilize agricultural produce or natural resources as raw materials, provided that in the opinion of the Board, they are non-existent in the Kingdom, or existent but inadequate, or use out-of-date production processes."},
{"name": "Section 19. Environmental Concerns", "text": "The investment project to which the Board may grant promotion shall be one which incorporates appropriate measures for the prevention and control of harmful effects to the quality of the environment in the interest of the common good of the general living of the public and for the perpetuation of mankind and nature."},
{"name": "Section 1", "text": "His Majesty King Bhumibol Adulyadej is graciously pleased to proclaim that:"},
{"name": "Section 63. Penalty for Owner of Land", "text": "A person having an ownership in the land and building in accordance with Section 6, whoever violating paragraph one of Section 6/1 or paragraph one of Section 6/2 shall be liable for punishment of a fine not exceeding one hundred thousand Baht."},
{"name": "Section 61. Fees for Registration", "text": "The application and the registration of condominium or juristic condominium, application and registration for the revocation of condominium, amendment of the Regulations, the issuance of apartment title deed or the substitute of apartment title deed, the application and the registration and the registration of right sand juristic acts or other businesses in connection with the apartment, the applicant shall pay the fees and expenses as prescribed in the Ministerial Regulations."},
{"name": "Section 6. Board of Investments", "text": "There shall be a Board of Investment consisting of the Prime Minister as Chairman, the Minister of Industry as Vice Chairman, not more than ten other competent persons appointed by the Prime Minister to act as members, and the Secretary General as member and secretary to the Board, having the powers and duties under this Act."},
{"name": "Section 60/1. Official Power", "text": "In performing in accordance with this Act, the competent official shall have the power as follows:"},
{"name": "Section 51. Revocation of Condo", "text": "The condominium already registered may be revoked upon any of the following reasons"},
{"name": "Section 42. General Meeting", "text": "The Manager shall arrange to have a General Meeting convened which shall be deemed to be the first Ordinary General Meeting within six months from the date of the registration of the condominium corporate in order that the Meeting can appoint the Board and consider for approval the Bylaws and the Manager having been registered in accordance with the application for the registration of the condominium corporate which has already been submitted."},
{"name": "Section 37. Condominium Corporate Committee", "text": "There shall be a Condominium Corporate Committee consisting of members of not less than three persons but not exceeding nine persons appointed by the Joint Owner General Meeting."},
{"name": "Section 31. Transfer of Rights of an Apartment", "text": "The transfer of rights in the apartment to any person without transferring the entire ownership in the apartment in the condominium to one or several persons holding the rights jointly shall be made only upon the transferor and the transferee of rights in the said apartment filing the application for the transfer of rights in the apartment together with the application for the registration of juristic condominium with the copy of the Regulations and evidence in the registration of condominium to the Competent Official."},
{"name": "Section 20. Issuance of Title Deed", "text": "Upon acceptance of the registration of the condominium under Section 7, the Competent Official shall issue apartment title deed according to the plan of the condominium registered without delay."},
{"name": "Section 19. Foreigners", "text": "Aliens (foreigners) and juristic persons regarded by law as aliens (foreign) may hold ownership of an apartment if the are the following:"},
{"name": "Section 12. Apartment Indivisible", "text": "The ownership of the apartment is indivisible."},
{"name": "Section 28. Competent Official", "text": "The Competent Official under this act shall be the Competent Official registering the rights and juristic acts in connection with the apartment."},
{"name": "Section 1. Name", "text": "His Majesty King Bhumibol Adulyadej has been graciously pleased to proclaim that:"},
{"name": "Section 56", "text": "A committee called \"the Copyright Committee\" shall be established and to be composed of the Permanent Secretary of the Minister of Commerce as Chairman as well as distinguished members not exceeding twelve persons appointed by the Cabinet in which not less than six persons are appointed from representatives of associations of the owners of copyright or performers’ rights and representatives of associations of the users of copyright or performers’ rights. The Committee may appoint any person secretary and assistant secretary."},
{"name": "Section 6. Land Owner Registration", "text": "Any owner of land and building wishing to register the said land and building as condominium under this act shall file application for registration of condominium with the Competent Official together with:"},
{"name": "Section 36", "text": "The public performance of a dramatic work or a musical work as appropriate which is not organized or conducted for seeking profit from such activity and without direct or indirect charge and the performers not receiving remuneration for such performance shall not be deemed an infringement of copyright; provided that it is conducted by an association, foundation or another organization having objectives for public charity, education, religion or social welfare and that Section 32 paragraph one is complied with."},
{"name": "Section 32", "text": "An act against a copyright work by virtue of this Act of another person which does not conflict with a normal exploitation of the copyright work by the owner of copyright and does not unreasonably prejudice the legitimate right of the owner of copyright shall not be deemed an infringement of copyright."},
{"name": "Section 27", "text": "Any of the following acts against a copyright work by virtue of this Act without the permission in accordance with Section 15(5) is deemed an infringement of copyright:"},
{"name": "Section 54", "text": "A Thai national who desires to seek a copyright license for a work which has already been communicated to public in the form of printed materials or other similar forms according to this Act for the benefit of study, teaching or research without a profit-seeking purpose may submit an application to the Director General by showing evidence that the applicant has previously sought a license from the copyright owner to translate the work into Thai or to reproduce the copies of the translation published in Thai but his request has been denied or after a reasonable period of time having elapsed the agreement cannot be concluded provided that at the time of submitting the application:"},
{"name": "Section 44", "text": "The performer has the following exclusive rights with respect to the acts concerning his performance:"},
{"name": "Section 19", "text": "Subject to Section 21 and Section 22, copyright by virtue of this Act endures for the life of the author and fifty years after the death of the author."},
{"name": "Section 6", "text": "Copyright works by virtue of this Act mean a work of authorship in the categories of literary, dramatic, artistic, musical, audiovisual, cinematographic, sound recording, sound and video broadcasting work or any other works in the literary, scientific or artistic domain, whatever may be the mode or form of its expression."},
{"name": "Section 13. Thai Wife Marrying Foreign Spouse", "text": "A woman of Thai nationality who marries an alien and may acquire the nationality of her husband according to the nationality law of her husband, shall, if she desires to renounce Thai nationality, make a declaration of her intention before the competent official according to the form and in the manner prescribed in the Ministerial Regulations."},
{"name": "Section 98", "text": "The Director-General may require security from any person or persons beneficially interested in any activity within the management or control of the Customs Department either by bond or otherwise to the satisfaction of the Director-General for the due performance of any condition, order, or activities related to the Customs Department or incidental thereto. All such bonds or other securities shall be valid in law and if a breach of any of the conditions thereof is committed, legal proceedings may be taken in the same manner as any bonds expressly directed by or provided for under the provisions of this Act or any other law. All such bonds shall be taken to and for the use of His Majesty’s Government, and may be cancelled by the Director-General after the expiration of two years as from the date of the bond, or if any time limit was prescribed for the performance of the conditions of the bond, as from such time limit."},
{"name": "Section 7. Birth", "text": "The following persons acquire Thai nationality by birth:"},
{"name": "Section 1", "text": "By royal command of His Majesty King Bhumibol Adulyadej it is hereby proclaimed that:"},
{"name": "Section 97 ter", "text": "The Director-General shall have the power to approve the establishment of a duty free zone for the operation of industrial, commercial or other activities which are beneficial to the economy of the country, and shall have the power to prescribe rules, procedures and conditions for the application for and the approval of establishment of a duty free zone."},
{"name": "Section 100", "text": "If in any prosecution in respect of any goods seized for non-payment on duties or for any other cause of forfeiture, or for the recovering any penalty or penalties under this Act, any dispute arises as to whether the proper duties have been paid in respect of such goods, or whether the goods have been legally imported, unshipped, exported, shipped, removed, stored, sold or otherwise dealt with, then and in every such case the burden of proof thereof shall be upon the defendant in such prosecution."},
{"name": "Section 87", "text": "Upon the submission of a shipment entry and landing of goods to be stored in a bonded warehouse, the competent official shall record a detailed account of such goods, and when satisfied that all the requirements of the laws, rules and regulations have been complied with, he shall certify that the goods have been duly stored in the bonded warehouse."},
{"name": "Section 64", "text": "All trade by sea from one part of the Kingdom to any other part thereof shall be deemed to be coasting trade, and all vessels while employed in such trade shall be deemed to be coasting vessels."},
{"name": "Section 61", "text": "Goods remaining in the custody of Customs in any of the following manner shall be deemed to be overtime goods:"},
{"name": "Section 72", "text": "The Director-General may designate outer anchorages for the Port of Bangkok or any other port for vessels to discharge and load all or any part of the goods and may prescribe the times when such outer anchorages may be used and issue rules for the supervision and control of such outer anchorages by customs officials. If any person commits or is involved in the commission of an offence under these rules or attempts or is involved in an attempt to commit an offence under these rules, such person shall be liable to a fine not exceeding one hundred thousand Bath, but his liability under this section shall not absolve him from liability under any other provisions of this Act or any other law."},
{"name": "Section 45", "text": "Before the exportation of any goods from the Kingdom, an exporter shall have fully complied with this Act and other laws relating to the Customs, duly submitted a shipment entry and paid the full amount of duty or deposited cash security. An application for the deposit of cash security shall be in accordance with regulations as prescribed by the Director-General."},
{"name": "Section 37 bis", "text": "All vessels that enter into or halt or moor in the contiguous sea shall answer any questions of the customs official concerning the vessel, crew, passenger, nature of the goods in the vessel and things carried on board the vessel as questioned by the customs official and shall comply with reasonable orders of the customs official. If the master does not answer or comply therewith, he shall be liable to a fine of not exceeding ten thousand Baht."},
{"name": "Section 14", "text": "While, goods pass through customs or are in any way under the supervision of the customs, any competent customs official may at any time, open the package and examine such goods and may take samples of any goods for examination, test, assessment, or for other purposes as necessary. Samples shall be delivered free of charge. The official may take sample from such packages or any post of the goods provided that such samples are taken in a reasonable size or quantity and in such a manner as to produce the least possible loss or inconvenience to the owner of the goods. And such samples shall be returned to the owner as soon as possible."},
{"name": "List One: Businesses ", "text": ""},
{"name": "Section 38", "text": "The master of every vessel, whether loaded or in ballast, coming from outside the boundary territory of the Kingdom shall make due report to the competent official on the prescribed form (Schedule 1) within twenty-four hours of arriving at a port. When making such a report, the master of the vessel shall produce for inspection the certificate of registry of his vessel, and such report shall be made before the bulk is broken unless specially allowed otherwise. If any vessel arriving at a port is loaded with foreign goods intended for exportation or landing elsewhere within the Kingdom, the master shall make a statement of such goods in his report. If such vessel proceeds to another port within the Kingdom, the master shall carry a “traveling copy” of such report, duly certified by the competent official, and produce it when he makes his arrival report at such other port and every subsequent port until the vessel exits or until all the foreign goods has been discharged, as the case may be. Any infringement of the provisions of this section shall be liable to a fine not exceeding one hundred thousand Bath, and all goods not duly reported shall be liable to detention until so reported, or until the omission is explained to the satisfaction of the Director-General."},
{"name": "Section 10", "text": "All taxes shall be collected in accordance with the provisions of this Act and the law on Customs Tariff. Payment of tax shall be made to the competent official at the time of issuing of the delivery order."},
{"name": "Section 3", "text": "His Majesty the King shall appoint or shall be graciously pleased to permit the Minister to appoint a suitable person as a chief management of the Customs Department to inspect the activities which are the duties of such department. Such person, hereinafter called the \"Director-General\", shall have the duty to supervise and control the staff of the Customs Department, the power to grant salaries and allowances, to require securities for good conduct, and to issue rules as he may deem necessary for the proper operation of the Department and its enforcement accordingly."},
{"name": "Section 37 six", "text": "In this Chapter"},
{"name": "Section 44. Prior Right to do Business", "text": "Foreigners who have acquired the right or have been permitted to operate businesses under the Notification of the National Executive Council No. 281, dated 24th November B.E. 2515 (1972) prior to the date of the entry into force of this Act shall continue to enjoy the right or be permitted to operate such businesses in accordance with the conditions and the term of the rights or permission so acquired."},
{"name": "Section 39. Failure to Comply with Notification Requirements", "text": "Any license grantee or certificate grantee who fails to comply with section 21 paragraph two or paragraph three or violates section 22 shall be liable to a fine not exceeding five thousand Baht."},
{"name": "List Three: Businesses in respect of which Thai nationals are not ready to compete with foreigners", "text": "Note: The reason for the promulgation of this Act is as follows. Whereas the Notification of the National Executive Council No. 281, dated 24th November B.E. 2515 (1972) which is currently in force has been in force for a considerable period of time and contains certain principles inconsistent with circumstances in economy, investment and international trade of the present time, it is expedient to revise the said law with a view to promoting competition in business operation both at domestic and international levels, which will be of value to Thailand as a whole, and thereby putting in place the implementation of obligations under international treaties as well. It is therefore necessary to enact this Act."},
{"name": "Section 34. Imprisonment for Continuing to Operation with License", "text": "Any foreigner, to whom a license or a certificate has been granted, who continues to operate the business after the license has been suspended or revoked or after the operation of the business to which the certificate relates has been ordered to be ceased without right to appeal or with the Minister giving a final decision mandating the suspension or revocation of the license or the cessation of the operation of the business, shall be liable to imprisonment for a term not exceeding three years or to a fine of one hundred thousand Baht to one million Baht or to both and to an additional fine at the daily rate of ten thousand Baht throughout the period of the violation."},
{"name": "Section 23. Foreign Business Commission", "text": "There shall be a Foreign Business Commission consisting of"},
{"name": "Section 27. Quorum", "text": "At a meeting of the Commission, the presence of not less than one half of the total number of the members is required to constitute a quorum. If the Chairperson is not present at the meeting or is unable to perform the duty, the members present shall elect one amongst themselves to preside over the meeting."},
{"name": "Section 17. Application for Foreign Business Permit", "text": "In applying for permission for the operation of a business, the foreigner shall file an application to the Minister or the Director‐General in accordance with the rules and procedures prescribed in the Ministerial Regulation; and the Council of Ministers, in the case of businesses in "},
{"name": "Section 14. Minimum Capital", "text": "The minimum capital to be used by a foreigner for the commencement of the operation of a business in Thailand shall not be less than that prescribed in the Ministerial Regulation, provided that it shall not be less than two million Baht."},
{"name": "Section 10. Exemptions for Treaty Nations", "text": "The provisions of section 5, section 8, section 15, section 17 and section 18 shall not apply to foreigners operating businesses specified in the Lists annexed hereto upon permission granted "},
{"name": "Section 5. Granting Foreigners the Right to Operate Business", "text": "In granting permission to foreigners for the operation of businesses under this Act, regard shall be had to advantageous and disadvantageous effects on national safety and security, economic and social development of the country, public order or good morals, national values in arts, culture, traditions and customs, natural resources conservation, energy, environmental preservation, consumer protection, sizes of undertakings, employment, technology transfer and research and development."},
{"name": "Section 1. Foreign Business Act", "text": "This Act is called the “Foreign Business Act, B.E. 2542 (1999)\"."},
{"name": "Section 78", "text": "Subject to Section 78/3, value added tax liability for sale of goods shall be in accordance with the following rules:"},
{"name": "Section 77", "text": "Value added tax is an assessment tax."},
{"name": "Section 40", "text": "Assessable income is income of the following categories including any amount of tax paid by the payer of income or by any other person on behalf of a taxpayer."},
{"name": "Section 65", "text": "Taxable income under this Part is net profit which is calculated by deducting income from business or income arising from business carried on in an accounting period with expenses in accordance with conditions prescribed in Section 65 Bis and Section 65 Ter. An accounting period shall be twelve months except in the following cases where it may be less than twelve months:"},
{"name": "Section 38", "text": "Income tax is an assessment tax. An assessment official shall make assessment on tax under this Chapter."},
{"name": "Section 28", "text": "An appeal shall be made in the form prescribed by the Director-General."},
{"name": "Section 14", "text": "Assessment tax is such assessment tax as clearly prescribed in each particular Chapter."},
{"name": "Section 13 Bis (2)", "text": "There shall be established a Commission of Taxation, comprising the Permanent Secretary of the Ministry of Finance as Chairman, the Director-General of Revenue Department, the Director-General of Customs Department, the Director-General of Excise Department, Director of Fiscal Policy Office, Secretary-General of Council of State and experts of 3 persons appointed by the Minister."},
{"name": "Section 17", "text": "In relation to tax return filing, it shall be filed within the time limit specified in the Chapters regarding taxes and in accordance with the form prescribed by the Director-General."},
{"name": "Section 5", "text": "Taxes and duties prescribed hereafter shall be within the power and control of the Revenue Department."},
{"name": "Section 1", "text": "This Act shall be called the “Revenue Code”."},
{"name": "Section 85", "text": "It is recognized that any alien who is authorized to stay temporarily in the Kingdom on the date that this Act comes into force is one who has been permitted to stay under this Act, but said alien will be entitled to the rights and benefits only as stated in the previous application."},
{"name": "Section 61", "text": "Whoever fails to comply with the written order under Section 10 shall be punished by a fine not exceeding 5,000 Baht."},
{"name": "Section 57", "text": "For the purpose of Chapter 7 miscellaneous ; whoever claims his nationality is Thai and if there is not enough evidence for the competent official to believe that he has Thai nationality, it is presumed that such a person is an alien until he can prove otherwise."},
{"name": "Section 53", "text": "If it is learned at a late date that aliens who came to stay in the Kingdom are among the persons excluded from entry because of any circumstance as prescribed in Section 12 (7) or (8)or (10) or Section 43 paragraph 2 or Section 44 or persons convicted under Section 63 or 64, the Director General will submit the matter to the Immigration Commission. If the Immigration Commission decides that the alien's permission to stay in the Kingdom should be revoked, the Immigration Commission will submit their opinion to the Minister for further consideration in revoking the Permission."},
{"name": "Section 34", "text": "Aliens entering into the kingdom for a temporary stay may enter for the below listed activities:"},
{"name": "Section 40", "text": "Subject to the provisions of Section 42, 43 and 51, the Minister, by the approval of the Cabinet, shall have power to publish, in the Government Gazette, immigration quotas from year to year (not exceeding 100 persons per year from each country and not exceeding 50 persons who have no nationality)."},
{"name": "Section 6", "text": "The immigration Commission will consist of the Under Secretary of the Minister of Interior as Chairman and the following members:"},
{"name": "Section 1", "text": "This Act shall be called the \"Immigration Act, B.E. 2522\""},
{"name": "Section 11", "text": "Persons entering into or departing the Kingdom must other and leave by way of immigration check points, designated landing, stations or areas and in accordance to the prescribed time as published in the Government Gazette by the Minister."},
{"name": "Section 23", "text": "The owner or person in charge of a conveyance must bring the conveyance into or out of the Kingdom thought the proper route, immigration check point, port boundaries station, or area, and time, which the minister shall publish in the Government Gazette."},
{"name": "Section 54", "text": "An action for damages in relation to carriage of the passenger, baggage and cargo, regardless of the cause of action under this Act, debt under the contract, obligation from tort or other obligations, shall be brought, subject to conditions and limit of liability provided in this Act."},
{"name": "Section 46", "text": "Subject to the provision of section 37 paragraph four, in the case of combined carriage performed partly by air and partly by any other mode of carriage, the provisions of this Act shall apply only to the carriage by air."},
{"name": "Section 32", "text": "When the consignor has carried out all the obligations under the contract of carriage, the consignor has the right to dispose the cargo as follows:"},
{"name": "Article 12: Royalties", "text": "Royalties arising in a Contracting State and paid to a resident of the other Contracting State may be taxed in that other State."},
{"name": "Section 9", "text": "In regard to carriage of passengers, document of carriage delivered shall include, at least, the followings:"},
{"name": "Section 39", "text": "Liability of the carrier in the case of destruction, loss, damage or delay is limited to nineteen Special Drawing Rights per kilogramme unless the consignor has made, at the time when the package was handed over to the carrier, a special declaration of interest in delivery at destination and has paid a supplementary sum."},
{"name": "Section 16", "text": "In the carriage of baggage, the liability of the carrier in the case of destruction, loss, damage or delay is limited to one thousand one hundred and thirty one Special Drawing Rights for each passenger except if at the time when the checked baggage was handed over to the carrier, the passenger has made a special declaration of interest in the delivery at destination and has paid a supplementary sum if the case so requires."},
{"name": "Section 24", "text": "In respect of the carriage of cargo, an air waybill shall be delivered."},
{"name": "Article 11: Interest", "text": "Interest arising in a Contracting State and paid to a resident of the other Contracting State may be taxed in that other State."},
{"name": "Article 10: Dividends", "text": "Dividends paid by a company which is a resident of a Contracting State to a resident of the other Contracting State may be taxed in that other State."},
{"name": "Article 8: Shipping and Air Transport", "text": "Income or profits which a resident of the United States derives from the operation of aircraft in international traffic shall be taxable only in the United States."},
{"name": "Article 2: Taxes Covered", "text": "The existing taxes to which this Convention shall apply are:"},
{"name": "Article 5: Permanent Establishment", "text": "For the purposes of this Convention, the term \"permanent establishment\" means a fixed place of business through which the business of an enterprise is wholly or partly carried on."},
{"name": "Article 4: Residence", "text": "For the purposes of this Convention, the term \"resident of a Contracting State\" means any person who, under the laws of that State, is liable to tax therein by reason of his domicile, residence, citizenship, place of management, place of incorporation, or any other criterion of a similar nature. The term also includes that State and any political subdivision or local authority thereof. The term, however, does not include any person who is liable to tax in that State in respect only of income from sources in that State."},
{"name": "Article 1: Personal Scope", "text": "The Government of the United States of America and the Government of the Kingdom of Thailand, desiring to conclude a Convention for the avoidance of double taxation and the prevention of fiscal evasion with respect to taxes on income, have agreed as follows:"},
{"name": "Article 6: Income from Immovable (Real) Property", "text": "Income derived by a resident of a Contracting State from immovable (real) property (including income from agriculture or forestry) situated in the other Contracting State may be taxed in that other State."}
]